app/views/pages/home.html.erb

SELECT "surveys".* FROM "surveys" WHERE "surveys"."user_id" = $1  [["user_id", 5]]
---
      <tbody>
        <% current_user.surveys.each do |survey| %>

SELECT COUNT(*) FROM "submissions" WHERE "submissions"."survey_id" = $1  [["survey_id", 31]]
---
            <th class="content"> <%= time_ago_in_words(survey.created_at)%> ago</th>
            <th class="content"> <%= survey.submissions.count %></th>