app/views/surveys/owner_display.html.erb

      <tbody>
        <% question.possible_answers.each do |poss_answer| %>
---
SELECT "possible_answers".* FROM "possible_answers" WHERE "possible_answers"."question_id" = $1  [["question_id", 42]]

    </table>
    <%= react_component("Graph", {question: question.prompt, answer1: {content: question.possible_answers.first.content, count: question.possible_answers.first.count}, answer2: {content: question.possible_answers[1].content, count: question.possible_answers[1].count }, answer3: {content: question.possible_answers.last.content, count: question.possible_answers.last.count }}) %>
---
SELECT "possible_answers"."content" FROM "possible_answers" WHERE "possible_answers"."question_id" = $1  [["question_id", 42]]