app/controllers/submissions_controller.rb

SELECT  "possible_answers".* FROM "possible_answers" WHERE "possible_answers"."id" = $1 LIMIT 1  [["id", 100]]
UPDATE "possible_answers" SET "count" = $1, "updated_at" = $2 WHERE "possible_answers"."id" = $3  [["count", 1], ["updated_at", "2015-06-21 19:40:54.244482"], ["id", 102]]
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT 1  [["id", 26]]
INSERT INTO "submissions" ("survey_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["survey_id", 26], ["created_at", "2015-06-21 19:40:54.274218"], ["updated_at", "2015-06-21 19:40:54.274218"]]
---
  def create
    ids = params[:answerIDs]
    survey_id = params[:surveyId]
    ids.each do |id|
      possible_answer = PossibleAnswer.find(id)
      count = possible_answer.count + 1
      possible_answer.update_attributes(count: count)
    end
    @survey = Survey.find(params[:surveyId])
    @submission = @survey.submissions.create()

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT 1  [["id", 4]]
---
  def show
    @submission = Submission.find(params[:id])