app/controllers/surveys_controller.rb

INSERT INTO "surveys" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "My survey"], ["user_id", 1], ["created_at", "2015-06-20 20:47:21.368246"], ["updated_at", "2015-06-20 20:47:21.368246"]]
INSERT INTO "questions" ("prompt", "survey_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["prompt", "How was it?"], ["survey_id", 8], ["created_at", "2015-06-20 20:56:51.927272"], ["updated_at", "2015-06-20 20:56:51.927272"]]
INSERT INTO "possible_answers" ("content", "question_id", "created_at", "updated_at", "count") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Lebron"], ["question_id", 38], ["created_at", "2015-06-21 19:46:40.984546"], ["updated_at", "2015-06-21 19:46:40.984546"], ["count", 0]]
SELECT "questions".* FROM "questions" WHERE "questions"."survey_id" = $1  [["survey_id", 8]]
---
  def create
    user_id = session[:user_id]
    title = params[:title]
    @survey = Survey.create(title: title, user_id: user_id)
    questions = params[:questions]
    questions.each_with_index do |question, idx|
      prompt = questions[idx.to_s]["data"]["question"]
      answer1 = questions[idx.to_s]["data"]["answer1"]
      answer2 = questions[idx.to_s]["data"]["answer2"]
      answer3 = questions[idx.to_s]["data"]["answer3"]
      question = Question.create(prompt: prompt, survey_id: @survey.id)
      question.possible_answers.create(content: answer1)
      question.possible_answers.create(content: answer2)
      question.possible_answers.create(content: answer3)
    end
    data_questions = @survey.questions.each do |question|

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT 1  [["id", 15]]
SELECT "questions".* FROM "questions" WHERE "questions"."survey_id" = $1  [["survey_id", 15]]
SELECT "possible_answers".* FROM "possible_answers" WHERE "possible_answers"."question_id" = $1  [["question_id", 14]]
---
  def show
    @survey = Survey.find(params[:id])
    @submission = @survey.submissions.build
    @letters = ["A","B","C"]
    @questions = @survey.questions.all
    @questions.to_a.map! {|question| {question: question, answers: question.possible_answers }}

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT 1  [["id", 31]]
SELECT "questions".* FROM "questions" WHERE "questions"."survey_id" = $1  [["survey_id", 31]]
---
  def owner_display
    @survey = Survey.find(params[:id])
    @questions = @survey.questions.all